perf/test_rendimiento.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/python/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 100 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp_1
      duration: 20
      arrivalRate: 10
      rampTo: 50
    - name: Plain_1
      duration: 30
      arrivalRate: 50
    - name: Ramp_2
      duration: 20
      arrivalRate: 50
      rampTo: 100
    - name: Plain_2
      duration: 30
      arrivalRate: 100
    - name: Ramp_3
      duration: 20
      arrivalRate: 100
      rampTo: 150
    - name: Plain_3
      duration: 30
      arrivalRate: 150
    - name: Ramp_4
      duration: 20
      arrivalRate: 150
      rampTo: 200
    - name: Plain_4
      duration: 30
      arrivalRate: 200
    - name: Ramp_5
      duration: 20
      arrivalRate: 200
      rampTo: 250
    - name: Plain_5
      duration: 30
      arrivalRate: 250
    - name: Ramp_6
      duration: 20
      arrivalRate: 250
      rampTo: 300
    - name: Plain_6
      duration: 30
      arrivalRate: 300
    - name: Ramp_7
      duration: 20
      arrivalRate: 300
      rampTo: 350
    - name: Plain_7
      duration: 30
      arrivalRate: 350
    - name: Ramp_8
      duration: 20
      arrivalRate: 350
      rampTo: 400
    - name: Plain_8
      duration: 30
      arrivalRate: 400
    - name: ramp_9
      duration: 30
      arrivalRate: 400
      rampTo: 450
    - name: Plain_9
      duration: 30
      arrivalRate: 450
    

scenarios:
  - name: intensive (/intensive)
    flow:
      - get:
          url: '/intensive'